src/InformationRegisters/TransactionReconciliation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<InformationRegister>
		<Properties>
			<Name>TransactionReconciliation</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Reconciled</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Document</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.BankTransfer</v8:Type>
						<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
						<v8:Type>cfg:DocumentRef.CashSale</v8:Type>
						<v8:Type>cfg:DocumentRef.Check</v8:Type>
						<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
						<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/BankReconciliation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Document>
		<Properties>
			<Name>BankReconciliation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.GeneralJournal</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>StatementToDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceCharge</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ServiceChargeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InterestEarned</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InterestEarnedDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BeginningBalance</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EndingBalance</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClearedBalance</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Difference</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClearedAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Memo</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankInterestEarnedAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BankServiceChargeAccount</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.ChartOfAccounts</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LineItems</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Transaction</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.BankTransfer</v8:Type>
								<v8:Type>cfg:DocumentRef.Deposit</v8:Type>
								<v8:Type>cfg:DocumentRef.CashSale</v8:Type>
								<v8:Type>cfg:DocumentRef.Check</v8:Type>
								<v8:Type>cfg:DocumentRef.CashReceipt</v8:Type>
								<v8:Type>cfg:DocumentRef.InvoicePayment</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Cleared</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DocNumber</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TransactionAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Companies</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Date</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/ReconciledDocumentsServerCall/Ext/Module.bsl
// Event subscribtion handler. Preventing posting if already included in a bank reconciliation document
// Parameters:
//  Source - DocumentObject - Document being posted
//  Cancel - boolean - cancel write 
//  WriteMode - DocumentWriteMode enumeration - current write mode
//  PostingMode - DocumentPostingMode enumeration - current posting mode
//
Procedure ReconciledDocumentBeforeWrite(Source, Cancel, WriteMode, PostingMode) Export
	// allow posting if key fields has not been changed
	If Source.DataExchange.Load Then
		return;
	EndIf;
	DocumentName = Source.Metadata().Name;
	If DocumentName = "BankTransfer" Then
		Amount = Source.Amount;
		Date = Source.Date;
		BankAccount = Source.AccountTo;
	ElsIf DocumentName = "CashReceipt" Then
		Amount = Source.CashPayment;
		Date = Source.Date;
		BankAccount = Source.BankAccount;
	ElsIf DocumentName = "CashSale" Then
		Amount = Source.DocumentTotalRC;
		Date = Source.Date;
		BankAccount = Source.BankAccount;
	ElsIf DocumentName = "Check" Then
		Amount = -1*Source.DocumentTotalRC;
		Date = Source.Date;
		BankAccount = Source.BankAccount;
	ElsIf DocumentName = "Deposit" Then
		Amount = Source.DocumentTotalRC;
		Date = Source.Date;
		BankAccount = Source.BankAccount;
	ElsIf DocumentName = "InvoicePayment" Then
		Amount = -1*Source.DocumentTotalRC;
		Date = Source.Date;
		BankAccount = Source.BankAccount;
	Else
		return;
	EndIf;
	If RequiresExcludingFromBankReconciliation(Source.Ref, Amount, Date, BankAccount, WriteMode) Then
		MessageText = String(Source.Ref) + ": " + NStr("en='This document is already included in a bank reconciliation. Please remove it from the bank rec first.'");
		CommonUseClientServer.MessageToUser(MessageText,,,,Cancel);
	EndIf;
EndProcedure

// Defines whether the document is required to be excluded from bank rec. document
// Should be excluded in the following cases:
//  1. amount differs from what is in the database
//  2. bank account differs from what is in the database
//  3. date exceeds the period of bank reconciliation document
// Parameters:
//  Ref - DocumentRef - Document being checked
//  NewAmount - Number - new amount of the document. 
//  NewDate - Date - new date of the document
//  NewAccount - CatalogRef.BankAccounts - new bank account of the document
//  WriteMode - DocumentWriteMode - current write mode
//
Function RequiresExcludingFromBankReconciliation(Val Ref, Val NewAmount, Val NewDate, Val NewAccount, Val WriteMode) Export
	If WriteMode = DocumentWriteMode.Posting Then
		SetPrivilegedMode(True);
		Query = New Query("SELECT
		                  |	TransactionReconciliation.Document,
		                  |	TransactionReconciliation.Amount,
		                  |	TransactionReconciliation.Account
		                  |INTO ReconciledValues
		                  |FROM
		                  |	InformationRegister.TransactionReconciliation AS TransactionReconciliation
		                  |WHERE
		                  |	TransactionReconciliation.Document = &Ref
		                  |	AND TransactionReconciliation.Reconciled = TRUE
		                  |;
		                  |
		                  |////////////////////////////////////////////////////////////////////////////////
		                  |SELECT
		                  |	ReconciledValues.Document,
		                  |	ReconciledValues.Amount,
		                  |	BankReconciliationLineItems.Ref.StatementToDate,
		                  |	ReconciledValues.Account,
		                  |	CASE
		                  |		WHEN ReconciledValues.Amount <> &NewAmount
		                  |				OR ENDOFPERIOD(BankReconciliationLineItems.Ref.StatementToDate, DAY) < &NewDate
		                  |				OR ReconciledValues.Account <> &NewAccount
		                  |			THEN TRUE
		                  |		ELSE FALSE
		                  |	END AS RequiresExcluding
		                  |FROM
		                  |	ReconciledValues AS ReconciledValues
		                  |		INNER JOIN Document.BankReconciliation.LineItems AS BankReconciliationLineItems
		                  |		ON ReconciledValues.Document = BankReconciliationLineItems.Transaction
		                  |			AND (BankReconciliationLineItems.Cleared = TRUE)
		                  |			AND (BankReconciliationLineItems.Ref.Posted = TRUE)
		                  |			AND (BankReconciliationLineItems.Ref.DeletionMark = FALSE)");
		Query.SetParameter("Ref", Ref);
		Query.SetParameter("NewAmount", NewAmount);
		Query.SetParameter("NewDate", NewDate);
		Query.SetParameter("NewAccount", NewAccount);
		
	    Selection = Query.Execute();
	
		SetPrivilegedMode(False);
	
		If NOT Selection.IsEmpty() Then
			Sel = Selection.Select();
			Sel.Next();
			return Sel.RequiresExcluding;
		Else
			return False;
		EndIf;	
	ElsIf WriteMode = DocumentWriteMode.UndoPosting Then
		SetPrivilegedMode(True);
		
		Query = New Query("SELECT
					  |	TransactionReconciliation.Document
					  |FROM
					  |	InformationRegister.TransactionReconciliation AS TransactionReconciliation
					  |WHERE
					  |	TransactionReconciliation.Document = &Ref
					  |	AND TransactionReconciliation.Reconciled = TRUE");
		Query.SetParameter("Ref", Ref);
		
		Selection = Query.Execute();
		
		SetPrivilegedMode(False);
		
		If NOT Selection.IsEmpty() Then
			return True;
		Else
			return False;
		EndIf;
	Else
		return False;		
	EndIf;
EndFunction
